src/cf/src/Catalogs/ИменаПользователей/ИменаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИменаПользователей</name>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктуализацииAD</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторAD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательОС</name>
    <comment>Аутентификационная информация вида \\домен\учетная запись</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринадлежитКAD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяАктуализацияПользователя1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗаписьWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПраваПользователя</name>
    <attributes>
      <name>ШаблонДоступа</name>
      <type>
        <types>CatalogRef.ШаблоныДоступаПользователей</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>Причина, номер запроса</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Основание</name>
      <type>
        <types>CatalogRef.ГруппыПользователейAD</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнформационныеБазыДляОбновленияПрав</name>
    <attributes>
      <name>ИнформационнаяБаза</name>
      <type>
        <types>CatalogRef.СписокИнформационныхБаз1С</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновитьПрава</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/ШаблоныДоступаПользователей/ШаблоныДоступаПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныДоступаПользователей</name>
  <comment>Заполняется через веб-сервис AccessControl.PutAccessPatterns() внешними системами</comment>
  <attributes>
    <name>ИД_ИнформационнойБазы</name>
    <comment>Должен быть уникальным в рамках одной сети</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.СписокИнформационныхБаз1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Catalogs/ИменаПользователей/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	ОбновитьБазыДляОбновленияПравПередЗаписью();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьБазыДляОбновленияПравПередЗаписью()
	
	ТаблицаИСДоИзменения 	= ТаблицаИнформационныхБазПоШаблонамДоступа(Ссылка.ПраваПользователя.ВыгрузитьКолонку("ШаблонДоступа"));
	ТаблицаИСПослеИзменения = ТаблицаИнформационныхБазПоШаблонамДоступа(ПраваПользователя.ВыгрузитьКолонку("ШаблонДоступа"));
	
	Изменения = ОбщегоНазначенияКупоросСервер.РазницаТаблицЗначений(ТаблицаИСДоИзменения, ТаблицаИСПослеИзменения);
	
	Для каждого ТекСтрока Из Изменения Цикл
		
		Справочники.ИменаПользователей.ДобавитьБазуДляОбновленияПрав(ЭтотОбъект, ТекСтрока.ИнформационнаяБаза);
				
	КонецЦикла;
	
КонецПроцедуры 

Функция ТаблицаИнформационныхБазПоШаблонамДоступа(СписокШаблоновДоступа)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ШаблоныДоступаПользователей.ИнформационнаяБаза КАК ИнформационнаяБаза,
	               |	ШаблоныДоступаПользователей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ШаблоныДоступаПользователей КАК ШаблоныДоступаПользователей
	               |ГДЕ
	               |	ШаблоныДоступаПользователей.Ссылка В(&СписокШаблонДоступа)";
	
	Запрос.УстановитьПараметр("СписокШаблонДоступа", СписокШаблоновДоступа);
	
	Результат = Запрос.Выполнить();
	ТаблицаДанных = Результат.Выгрузить();
	
	Возврат ТаблицаДанных;

КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
